heckertobias/wireless-sewing/sdkconfig.defaults
# ESP32-S3 KEY V1.0 dongle (ESP32-S3-WROOM-1, 8 MB flash).
# PSRAM is present on the module but not enabled yet - see CLAUDE.md.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# WiFi buffer tuning (from esp-iot-solution usb_msc_wireless_disk example)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_RX_BA_WIN=32

CONFIG_LWIP_TCPIP_TASK_PRIO=23
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64

# FAT32, long filenames, UTF-8 - required for Bernina compatibility.
# exFAT stays disabled (not set) - format_if_mount_failed will only ever
# produce FAT12/16/32 depending on card size, never exFAT.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_CODEPAGE_DYNAMIC=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_USE_LABEL=y

# TinyUSB MSC
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096

# Board: ESP32-S3 KEY V1.0 - microSD on SDMMC, 4-bit (CLK36/CMD35/D0-37/D1-38/D2-33/D3-34)
CONFIG_ESP32_S3_GENERIC=y
CONFIG_USE_EXTERNAL_SDCARD=y
CONFIG_SDCARD_INTFC_SDIO=y
CONFIG_SDCARD_SDIO_DATA_WIDTH_4=y
